#+TITLE:     Project Euler
#+DATE:      2011-05-25 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:1 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LINK_UP:   index.html
#+LINK_HOME: index.html


*** find sum all of the multiples of 3 or 5 below 1000
#+begin_src ruby :exports all :results output
  count = 0
  1.upto(999) do |i|
    if ((i % 3 == 0) or (i % 5 == 0)) then
        count += i
    end
  end
  puts "sum is #{count}"
#+end_src

#+results:
: sum is 233168

*** sum of the even-valued fibonacci terms that are lte 4,000,000 
#+begin_src ruby :exports all :results output
  i = 2
  n2 = 1
  n1 = 2
  total = 2
  n = n1 + n2
  while n <= 4000000 do
    i += 1
    if(n % 2 == 0) then
      #puts "i is #{i}, n-2 is #{n2}, n-1 is #{n1}, n is #{n}"
      total += n
    end
    n2 = n1
    n1 = n
    n = n1 + n2
  end
  print "total is ", total
  
#+end_src

#+results:
: total is 4613732

* Problem 4 
A palindromic number reads the same both ways. The largest palindrome made from the product of two 2-digit numbers is 9009 = 91  99.

+ Find the largest palindrome made from the product of two 3-digit numbers.
#+begin_src ruby :results output :exports both
  def is_palindrome(n)
    # change number to string
    n = n.to_s.split(//)
    # get num digits to check for palindrome 
    len = n.size/2
    1.upto(len) do |i|
      if n[i-1] != n[-i] then
        return false
      end
    end
    return true
  end
  999.downto(900) do |i|
    999.downto(900) do |j|
      num = i * j
      if is_palindrome num then
        puts "found one #{num}, its #{i} * #{j}"
        break
      end
    end
  end
  
#+end_src

#+results:
#+begin_example
found one 906609, its 993 * 913
found one 886688, its 968 * 916
found one 888888, its 962 * 924
found one 861168, its 932 * 924
found one 888888, its 924 * 962
found one 886688, its 916 * 968
found one 824428, its 914 * 902
found one 906609, its 913 * 993
found one 819918, its 909 * 902
found one 824428, its 902 * 914
#+end_example

** Find the smallest integer that is evenly divisible by all the numbers 1..20.
#+begin_src ruby :exports both :results output
  def div_by_all n 
    if n%10==0 and n%11==0 and n%12==0 and n%13==0 and n%14==0 and n%15==0 and n%16==0 and n%17==0 and n%18==0 and n%19==0 and n%20==0 then
      return true
    end
    return nil
  end
  
  def is_div_all n 
    if n%10==0 and n%11==0 and n%12==0 and n%13==0 and n%14==0 and n%15==0 and n%16==0 and n%17==0 and n%18==0 and n%19==0 and n%20==0  then
      printf "#{n} works!\n"
    else 
      printf "no way man\n"
    end
  end
  
  i = 2520
  until div_by_all(i) do
    i += 2520
  end
  is_div_all i
  print "found it: #{i}\n"
#+end_src

#+results:
: 232792560 works!
: found it: 232792560

*** Find the difference between the sum of the squares of the first one hundred natural numbers and the square of the sum
#+begin_src ruby :exports both :results output
  def sum_of_sq(n)
    total = 0
    1.upto(n) do |n|
      total += n*n
    end
    return total
  end
  
  def sq_of_sums(n)
    sum = 0
    1.upto(n) do |n|
      sum += n
    end
    return sum*sum
  end  
  
  ans_sqsum = sq_of_sums 100
  ans_sumsq = sum_of_sq 100
  ans_final = ans_sumsq - ans_sqsum
  puts "sq of sums is #{ans_sqsum}"
  puts "sum of squares is #{ans_sumsq}"
  puts "difference is #{ans_final}"
#+end_src

#+results:
: sq of sums is 25502500
: sum of squares is 338350
: difference is -25164150
    
* Problem 7
By listing the first six prime numbers: 2, 3, 5, 7, 11, and 13, we can see that the 6th prime is 13.
What is the 10001st prime number?
#+begin_src ruby :exports code :results output

#2 is first prime
@primes = [2]
def check_prime n 
  @primes.each do |p|
    return false if n%p==0
  end
  @primes << n
end
#2.upto(10) do |i|
#  check_prime(i)
#end

i = 3
last_prime = 0
while @primes.length < 10001 do 
  check_prime(i)
  i += 2
end 
# @primes.each do |j|
#   puts "#{j} is the prime!"
# end
last_prime = @primes[-1]
puts "#{last_prime} is the 10,001 prime"

#+end_src

#+results:
: 104743 is the 10,001 prime

* problem 13
first 10 digits of sum of following
100 50-digit numbers [...]
#+begin_src ruby :exports both :results output
  # first cut and pasted numbers into
  # txt file 'nums.txt'
  sum = 0
  open("./nums.txt").readlines.each do |l|
    sum += l.to_i
  end
  sum_str = sum.to_s
  puts "first 10 digits of sum: " + sum_str[0..9]
#+end_src

#+results:
: first 10 digits of sum: 5537376230

* Problem 20
Find the sum of the digits of 100!
this is simple to do in Ruby, with
its automatic bignum conversion
#+begin_src ruby :results output :exports both

total = 1
# get the bignum 100!
1.upto(100) do |n|
  total *= n
end

# convert to string
total_str = total.to_s
total_arr = total_str.split(//)

sum = 0
total_arr.each do |t|
  sum += t.to_i
end

puts sum
#+end_src

#+results:
: 648

* Problem 25: first Fibonacci term to break 1000 digits
#+begin_src python :results output :exports both 
import math

term = 3
n2 = 1
n1 = 1
n = 2

while(math.ceil(math.log10(n)) < 1000):
  n2 = n1
  n1 = n
  n = n2 + n1
  term+=1

print "fib term:", term

#+end_html
#+end_src

#+results:
: fib term: 4782

* problem 48
last 10 digits of 1^1 + 2^2 + ... +
1000^1000
#+begin_src ruby :exports both :results output
sum = 0
1.upto(1000) do |n|
  sum += n**n
end
sum_s = sum.to_s
sum_arr = sum_s.split(//)
puts sum_arr[-10..-1].join()

#+end_src

#+results:
: 9110846700

